In [6]:
# %cd
# %cd seaborn-data/
%ls

 Volume in drive C has no label.
 Volume Serial Number is 4CD3-B1F1

 Directory of C:\Users\AMOS OSHIYOYE\seaborn-data

09/01/2022  12:19 AM    <DIR>          .
09/01/2022  12:19 AM    <DIR>          ..
08/26/2022  08:48 PM            36,263 planets.csv
09/01/2022  12:19 AM            57,018 titanic.csv
               2 File(s)         93,281 bytes
               2 Dir(s)  121,353,990,144 bytes free

In [8]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [10]:
titanic=sns.load_dataset('titanic')

In [16]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [21]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [26]:
titanic.pivot_table('survived','embark_town','sex')

sex            female      male
embark_town
Cherbourg    0.876712  0.305263
Queenstown   0.750000  0.073171
Southampton  0.689655  0.174603

In [47]:
titanic.isnull().any()

survived       False
pclass         False
sex            False
age             True
sibsp          False
parch          False
fare           False
embarked        True
class          False
who            False
adult_male     False
deck            True
embark_town     True
alive          False
alone          False
dtype: bool

In [50]:
titanic[titanic.age.isna()].count()

survived       177
pclass         177
sex            177
age              0
sibsp          177
parch          177
fare           177
embarked       177
class          177
who            177
adult_male     177
deck            19
embark_town    177
alive          177
alone          177
dtype: int64

In [42]:
titanic.age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: age, Length: 891, dtype: bool

In [46]:
titanic.age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [35]:
titanic[titanic.embark_town.isnull()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [ ]:
unique